{
	"@metadata": {
		"authors": [
			"SomeRandomDeveloper"
		]
	},
	"robloxapi-desc": "{{desc|name=RobloxAPI|url=https://www.mediawiki.org/wiki/Extension:RobloxAPI}}",
	"robloxapi-error-no-arguments": "Error message shown when no arguments are provided to the #robloxAPI parser function",
	"robloxapi-error-invalid-id": "Error message shown when an invalid ID is provided to a parser function. $1 is the invalid ID",
	"robloxapi-error-invalid-data": "Error message shown when the API returns invalid data",
	"robloxapi-error-decode-failure": "Error message shown when the API response cannot be decoded",
	"robloxapi-error-datasource-not-found": "Error message shown when a data source is not found. $1 is the ID of the missing data source",
	"robloxapi-error-unexpected-data-structure": "Error message shown when the API returns an unexpected data structure",
	"robloxapi-error-datasource-returned-no-data": "Error message shown when a data source returns no data",
	"robloxapi-error-user-group-not-found": "Error message shown when the group data for a user cannot be found",
	"robloxapi-error-request-failed": "Error message shown when a request to the API fails",
	"robloxapi-error-arg-not-allowed": "Error message shown when an argument is not allowed for a specific type. $1 is the invalid argument and $2 is the type",
	"robloxapi-error-invalid-thumbnail-size": "Error message shown when an invalid thumbnail size is provided",
	"robloxapi-error-invalid-username": "Error message shown when an invalid username is provided",
	"robloxapi-error-missing-argument": "Error message shown when a required argument is missing. $1 is the type of argument that is missing",
	"robloxapi-error-missing-optional-argument-value": "Error message shown when an optional argument is missing a value. The optional argument must be in the format 'key=value'",
	"robloxapi-error-unknown-optional-argument": "Error message shown when an unknown optional argument is provided. $1 is the unknown argument's key",
	"robloxapi-error-invalid-thumbnail-format": "Error message shown when an invalid thumbnail format is provided. $1 is the invalid format. Possible values are 'Webp' and 'Png'",
	"robloxapi-error-invalid-boolean": "Error message shown when an invalid boolean value is provided. $1 is the invalid value. Must be 'true' or 'false'",
	"robloxapi-error-invalid-return-policy": "Error message shown when an invalid return policy is provided. $1 is the invalid policy. Must be 'PlaceHolder', 'ForcePlaceHolder', 'AutoGenerated', or 'ForceAutoGenerated'",
	"robloxapi-error-too-many-required-args": "Error message shown when too many required arguments are provided to a data source. $1 is the argument that exceeds the maximum number of required arguments",
	"robloxapi-error-invalid-user-games-limit": "Error message shown when an invalid limit is provided for the user games data source. $1 is the invalid limit. Must be 10, 25 or 50",
	"robloxapi-error-invalid-sort-order": "Error message shown when an invalid sort order is provided. $1 is the invalid sort order. Must be 'Asc' or 'Desc'",
	"robloxapi-error-usage-limit": "Error message shown when trying to exceed a data source usage limit. $1 is the data source id, $2 the amount of times it can be used per page.",
	"robloxapi-error-usage-limit-dependent": "Error message shown when trying to exceed a data source usage limit through a dependent data source. $1 is the id of the fetcher data source, $2 the amount of times it can be used per page, $3 is the id of the dependent data source.",
	"robloxapi-category-deprecated-parser-function": "{{Tracking category name}}\nName of tracking category that pages are placed into when a deprecated parser function of the RobloxAPI extension is used on them.",
	"robloxapi-category-deprecated-parser-function-desc": "Description of the deprecated parser function tracking category.",
	"robloxapi-category-error": "{{Tracking category name}}\nName of tracking category that pages are placed into when usage of the robloxAPI parser function results in an error.",
	"robloxapi-category-error-desc": "Description of the RobloxAPI error tracking category."
}
